const htmlDescription = `\
# これから作るアプリについて
あなたのスマホで使えるアプリを作りましょう。

App Store や Google Play などで提供されている多くのアプリとは異なり、今回作るものは実際のところは「ウェブサイト」です。

といっても、見た目は普通のアプリとあまり変わりません。

さらに知りたい方は「PWA (プログレッシブウェブアプリ)」と調べてみると良いでしょう！

# 画面構成

左側、真ん中、右側の3つの部分に分かれています。

右から左の順に見ていきましょう。

## 右側

この説明です。

## 真ん中

- プログラムを書く場所です。

# 左側

- マウス操作で作業を進めることができます。
- ここで行った変更は、真ん中のエディタに反映されます。
- 構造という項目があります。

# 使ってみよう

例として、ボタンを押すと表示されている文章が変わるプログラムを作ってみましょう。

## 構造の操作

「構造」を操作してみましょう。

1. 「構造」の部分から、"hello" という名前の箱を作ります。「箱」の「つける名前」の欄に hello と入力して「追加」を押せば作ることができます。
2. エディタで、中の文章を「あいさつ」に書き換えます。
`;

export default htmlDescription;
